threatment_features = (
    [
        ("square_shifted", "Верх"),
        ("square_shifted", "Низ"),
        ("square_shifted", "Середина"),
    ]
    + [
        ("mas_val_shifted", "Верх"),
        ("mas_val_shifted", "Низ"),
        ("mas_val_shifted", "Середина"),
    ]
    + [
        ("mas_ang_shifted", "Верх"),
        ("mas_ang_shifted", "Низ"),
        ("mas_ang_shifted", "Середина"),
    ]
)  # массы нанесенные на предыдущем исытании

cat_features = [
    ("test_info_shifted", "socket_num"),
    ("test_info_shifted", "stand_group_name"),
    #                 ('test_info', 'socket_num'), ('test_info', 'stand_group_name') # вероятно это неизвестнов будущем
]

stats_previous_features = [
    ("stats_shifted", "std_po_ang"),
    ("stats_shifted", "std_vt_ang"),
    ("stats_shifted", "max_real_achieved_freq"),
    ("stats_shifted", "diff_freq_last_valid"),
    ("stats_shifted", "linear_corf_po_bien_val"),
    ("stats_shifted", "linear_corf_vt_bien_val"),
]
# Заменим, будто это не рассчитывалось - упростит предобработку,если сработает

po_shifted_features = [("po_bien_val_shifted", i) for i in range(149, 650, 50)]
vt_shifted_features = [("vt_bien_val_shifted", i) for i in range(149, 650, 50)]

po_ang_shifted_features = [
    ("po_bien_ang_shifted", i) for i in range(149, 650, 50)
]
vt_ang_shifted_features = [
    ("vt_bien_ang_shifted", i) for i in range(149, 650, 50)
]


# Группируем по трансформерам
binned_columns = [
    ("stats_shifted", "max_real_achieved_freq"),
    ("stats_shifted", "diff_freq_last_valid"),
]
log_columns = [
    ("stats_shifted", "std_po_ang"),
    ("stats_shifted", "std_vt_ang"),
    ("square_shifted", "Верх"),
    ("square_shifted", "Низ"),
    ("square_shifted", "Середина"),
]
quantile_columns = [
    ("stats_shifted", "linear_corf_po_bien_val"),
    ("stats_shifted", "linear_corf_vt_bien_val"),
]
power_columns = (
    po_shifted_features
    + vt_shifted_features
    + [
        ("mas_val_shifted", "Верх"),
        ("mas_val_shifted", "Низ"),
        ("mas_val_shifted", "Середина"),
    ]
)
one_hot_columns = cat_features  # Подозреваю, что приводит к немонотонности squared - перенесено


mas_by_square_range = {
    "Верх": {
        "35*60": {"p5": 103.0, "p95": 192.0, "p99": 198.0},
        "210*25": {"p5": 321.0, "p95": 489.0, "p99": 498.0},
        "25*45": {"p5": 6.0, "p95": 90.0, "p99": 98.0},
        "210*50": {"p5": 767.0, "p95": 975.0, "p99": 1001.8000000000002},
        "210*38": {"p5": 509.0, "p95": 734.0, "p99": 755.0},
        "210*62": {"p5": 1014.6, "p95": 1229.8, "p99": 1256.0},
        "210*75": {"p5": 1266.5, "p95": 1484.0, "p99": 1504.9},
        "35*45": {"p5": 3.1, "p95": 4.9, "p99": 4.98},
        "210*100": {"p5": 1771.25, "p95": 1954.45, "p99": 1963.69},
        "210*88": {"p5": 1512.75, "p95": 1746.25, "p99": 1749.37},
        "210*125": {"p5": 2276.0, "p95": 2396.0, "p99": 2404.8},
        "210*112": {"p5": 2021.75, "p95": 2101.95, "p99": 2112.39},
    },
    "Низ": {
        "210*38": {"p5": 508.0, "p95": 731.3499999999985, "p99": 754.0},
        "25*45": {"p5": 8.0, "p95": 90.0, "p99": 98.0},
        "35*60": {"p5": 103.0, "p95": 192.0, "p99": 198.0},
        "210*50": {"p5": 766.0, "p95": 977.0, "p99": 1002.0},
        "210*25": {"p5": 321.0, "p95": 488.0, "p99": 498.0},
        "210*62": {"p5": 1018.0, "p95": 1223.6, "p99": 1249.3600000000001},
        "210*75": {"p5": 1264.9, "p95": 1486.45, "p99": 1509.0},
        "210*100": {"p5": 1763.35, "p95": 1970.8, "p99": 1998.16},
        "210*88": {"p5": 1532.55, "p95": 1749.2, "p99": 1753.95},
        "210*112": {"p5": 2152.75, "p95": 2202.25, "p99": 2204.45},
        "210*125": {"p5": 2415.35, "p95": 2601.65, "p99": 2609.93},
    },
    "Середина": {
        "210*125": {"p5": 2279.0, "p95": 2500.0, "p99": 2500.0},
        "210*75": {"p5": 1271.65, "p95": 1497.0, "p99": 1507.0},
        "210*88": {"p5": 1520.0, "p95": 1746.0, "p99": 1758.0},
        "210*112": {"p5": 2019.0, "p95": 2245.0, "p99": 2257.0},
        "210*62": {"p5": 1022.0, "p95": 1247.0, "p99": 1258.0},
        "210*38": {"p5": 515.0, "p95": 750.0, "p99": 759.0},
        "35*60": {"p5": 103.0, "p95": 190.0, "p99": 198.0},
        "210*100": {"p5": 1770.0, "p95": 1994.6999999999998, "p99": 2006.0},
        "210*25": {"p5": 321.0, "p95": 490.0, "p99": 498.8899999999994},
        "25*45": {"p5": 10.0, "p95": 91.0, "p99": 98.0},
        "210*50": {"p5": 771.0, "p95": 995.0, "p99": 1008.0},
    },
}

# испытание перед первым ВЧ
po_bien_range = {
    149: {"p5": 0.4, "p95": 4.34, "p99": 5.68},
    199: {"p5": 0.36, "p95": 4.13, "p99": 5.48},
    249: {"p5": 0.36, "p95": 4.13, "p99": 5.497400000000052},
    299: {"p5": 0.38, "p95": 4.18, "p99": 5.51},
    349: {"p5": 0.4, "p95": 4.23, "p99": 5.55},
    399: {"p5": 0.43, "p95": 4.32, "p99": 5.63},
    449: {"p5": 0.46, "p95": 4.43, "p99": 5.74},
    499: {"p5": 0.48, "p95": 4.59, "p99": 5.95},
    549: {"p5": 0.52, "p95": 4.8, "p99": 6.24},
    599: {"p5": 0.56, "p95": 5.24, "p99": 6.8774999999999995},
    649: {"p5": 0.7130000000000017, "p95": 6.75, "p99": 8.64},
}

# испытание перед первым ВЧ
vt_bien_range = {
    149: {"p5": 1.36, "p95": 11.33, "p99": 13.05},
    199: {"p5": 1.38, "p95": 11.35, "p99": 13.09},
    249: {"p5": 1.38, "p95": 11.45, "p99": 13.23},
    299: {"p5": 1.4, "p95": 11.56, "p99": 13.4},
    349: {"p5": 1.41, "p95": 11.7, "p99": 13.66},
    399: {"p5": 1.45, "p95": 12.0, "p99": 14.13},
    449: {"p5": 1.5, "p95": 12.39, "p99": 14.71},
    499: {"p5": 1.58, "p95": 12.93, "p99": 15.48},
    549: {"p5": 1.72, "p95": 13.72, "p99": 16.589400000000023},
    599: {"p5": 1.92, "p95": 15.06, "p99": 18.307499999999997},
    649: {"p5": 2.3, "p95": 17.63, "p99": 21.539400000000022},
}

# испытания до первого ВЧ
mas_range = {
    "Верх": {"p5": 0.0, "p95": 591.0, "p99": 827.0},
    "Низ": {"p5": 0.0, "p95": 552.0, "p99": 782.0},
    "Середина": {"p5": 0.0, "p95": 1835.0, "p99": 2500.0},
}
